import { useNavigate, Link } from "react-router-dom";
import { useContext } from "react";
import { ThemeContext } from "../provider/ThemeContext";
import Header from "./Header";
import { topics } from "../data/topic";

const Home = () => {
  const { theme } = useContext(ThemeContext);

  const navigate = useNavigate();
  const handleClick = () => {
    navigate("/layout");
  };
  return (
    <div className={`home ${theme}`}>
      <h1 className="home__title">Конспект по <span>React</span></h1>
      <button className="home__btn" onClick={handleClick}>
        Перейти к темам
      </button>
      <p className="home__text">
        Или выбери тему, чтобы быстро повторить материал:
      </p>
      <div className="home__topics-list">
        {topics.map((topic) => (
          <Link
            key={topic.id}
            to={`/layout/${topic.path}`}
            className="topic-card"
          >
            <p>{topic.title}</p>
          </Link>
        ))}
      </div>
      <div className="features">
        <div className="features__grid">
          <div className="card">
            <svg
              className="icon"
              width="60px"
              height="60px"
              viewBox="0 0 24 24"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                fillRule="evenodd"
                clipRule="evenodd"
                d="M12.261 1.03462C12.6971 1.15253 13 1.54819 13 1.99997V8.99997H19C19.3581 8.99997 19.6888 9.19141 19.8671 9.50191C20.0455 9.8124 20.0442 10.1945 19.8638 10.5038L12.8638 22.5038C12.6361 22.8941 12.1751 23.0832 11.739 22.9653C11.3029 22.8474 11 22.4517 11 22V15H5C4.64193 15 4.3112 14.8085 4.13286 14.498C3.95452 14.1875 3.9558 13.8054 4.13622 13.4961L11.1362 1.4961C11.3639 1.10586 11.8249 0.916719 12.261 1.03462ZM6.74104 13H12C12.5523 13 13 13.4477 13 14V18.301L17.259 11H12C11.4477 11 11 10.5523 11 9.99997V5.69889L6.74104 13Z"
                fill="#3b82f6"
              />
            </svg>
            <h3>Быстро</h3>
            <p>Нужная информация всегда под рукой</p>
          </div>

          <div className="card">
            <svg
              className="icon"
              width="60px"
              height="60px"
              viewBox="0 0 16 16"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M8.01005 0.858582L6.01005 14.8586L7.98995 15.1414L9.98995 1.14142L8.01005 0.858582Z"
                fill="#3b82f6"
              />
              <path
                d="M12.5 11.5L11.0858 10.0858L13.1716 8L11.0858 5.91422L12.5 4.5L16 8L12.5 11.5Z"
                fill="#3b82f6"
              />
              <path
                d="M2.82843 8L4.91421 10.0858L3.5 11.5L0 8L3.5 4.5L4.91421 5.91422L2.82843 8Z"
                fill="#3b82f6"
              />
            </svg>
            <h3>Практично</h3>
            <p>Примеры кода и реальные кейсы</p>
          </div>

          <div className="card">
            <svg
              className="icon"
              width="60px"
              height="60px"
              viewBox="0 0 24 24"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M4 19V6.2C4 5.0799 4 4.51984 4.21799 4.09202C4.40973 3.71569 4.71569 3.40973 5.09202 3.21799C5.51984 3 6.0799 3 7.2 3H16.8C17.9201 3 18.4802 3 18.908 3.21799C19.2843 3.40973 19.5903 3.71569 19.782 4.09202C20 4.51984 20 5.0799 20 6.2V17H6C4.89543 17 4 17.8954 4 19ZM4 19C4 20.1046 4.89543 21 6 21H20M9 7H15M9 11H15M19 17V21"
                stroke="#3b82f6"
                strokeWidth="2"
                strokeLinecap="round"
                strokeLinejoin="round"
              />
            </svg>
            <h3>Структурировано</h3>
            <p>Темы собраны и систематизированы</p>
          </div>

          <div className="card">
            <svg
              className="icon"
              width="60px"
              height="60px"
              viewBox="0 0 24 24"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M17 12C17 14.7614 14.7614 17 12 17C9.23858 17 7 14.7614 7 12C7 9.23858 9.23858 7 12 7C14.7614 7 17 9.23858 17 12Z"
                fill="#3b82f6"
              />
              <path
                fillRule="evenodd"
                clipRule="evenodd"
                d="M12 1.25C12.4142 1.25 12.75 1.58579 12.75 2V4C12.75 4.41421 12.4142 4.75 12 4.75C11.5858 4.75 11.25 4.41421 11.25 4V2C11.25 1.58579 11.5858 1.25 12 1.25ZM3.66865 3.71609C3.94815 3.41039 4.42255 3.38915 4.72825 3.66865L6.95026 5.70024C7.25596 5.97974 7.2772 6.45413 6.9977 6.75983C6.7182 7.06553 6.2438 7.08677 5.9381 6.80727L3.71609 4.77569C3.41039 4.49619 3.38915 4.02179 3.66865 3.71609ZM20.3314 3.71609C20.6109 4.02179 20.5896 4.49619 20.2839 4.77569L18.0619 6.80727C17.7562 7.08677 17.2818 7.06553 17.0023 6.75983C16.7228 6.45413 16.744 5.97974 17.0497 5.70024L19.2718 3.66865C19.5775 3.38915 20.0518 3.41039 20.3314 3.71609ZM1.25 12C1.25 11.5858 1.58579 11.25 2 11.25H4C4.41421 11.25 4.75 11.5858 4.75 12C4.75 12.4142 4.41421 12.75 4 12.75H2C1.58579 12.75 1.25 12.4142 1.25 12ZM19.25 12C19.25 11.5858 19.5858 11.25 20 11.25H22C22.4142 11.25 22.75 11.5858 22.75 12C22.75 12.4142 22.4142 12.75 22 12.75H20C19.5858 12.75 19.25 12.4142 19.25 12ZM17.0255 17.0252C17.3184 16.7323 17.7933 16.7323 18.0862 17.0252L20.3082 19.2475C20.6011 19.5404 20.601 20.0153 20.3081 20.3082C20.0152 20.6011 19.5403 20.601 19.2475 20.3081L17.0255 18.0858C16.7326 17.7929 16.7326 17.3181 17.0255 17.0252ZM6.97467 17.0253C7.26756 17.3182 7.26756 17.7931 6.97467 18.086L4.75244 20.3082C4.45955 20.6011 3.98468 20.6011 3.69178 20.3082C3.39889 20.0153 3.39889 19.5404 3.69178 19.2476L5.91401 17.0253C6.2069 16.7324 6.68177 16.7324 6.97467 17.0253ZM12 19.25C12.4142 19.25 12.75 19.5858 12.75 20V22C12.75 22.4142 12.4142 22.75 12 22.75C11.5858 22.75 11.25 22.4142 11.25 22V20C11.25 19.5858 11.5858 19.25 12 19.25Z"
                fill="#3b82f6"
              />
            </svg>
            <h3>Темная тема</h3>
            <p>Комфорт для глаз в любое время</p>
          </div>
        </div>

        {/* <div className="stats">
          <div className="stat">
            <h2>20+</h2>
            <p>Тем</p>
          </div>

          <div className="divider"></div>

          <div className="stat">
            <h2>100+</h2>
            <p>Примеров</p>
          </div>

          <div className="divider"></div>

          <div className="stat">
            <h2>1</h2>
            <p>Цель — твой рост</p>
          </div>
        </div> */}
      </div>
    </div>
  );
};

export default Home;
